package ru.netology.nerecipe.demo

import ru.netology.nerecipe.models.RecipeModel

val recipePan = RecipeModel(
    recipeId = 3L,
    recipeName = "Том ям на максималках",
    author = "Александр Селютин",
    category = "Паназиатская кухня",
    recipeImagePath = "https://www.gastronom.ru/binfiles/images/20220623/bec2dd4c.jpeg",
    isFavorite = false
)

val listOfLinksPan = listOf(
    "null",

    "https://www.gastronom.ru/binfiles/images/20220623/b4e57d43.jpeg",

    "https://www.gastronom.ru/binfiles/images/20220623/bc52b26b.jpeg",

    "https://www.gastronom.ru/binfiles/images/20220623/bce2083c.jpeg",

    "https://www.gastronom.ru/binfiles/images/20220623/bc62c8bb.jpeg",

    "https://www.gastronom.ru/binfiles/images/20220623/b4f34c04.jpeg",

    "https://www.gastronom.ru/binfiles/images/20220623/b3d4d293.jpeg"
)

val listOfStepsPan = listOf(

    "Креветки 400г,Мидии 200г,Шампиньоны 400г,Кукуруза-мини 125г,бэби-морковь 100г" +
            "Лайм 1шт,бульон 2л,лук-порей 1шт,Имбирь 1шт,Лимонник 1-2шт,Листья кафир-лайма 4шт," +
            "рыбный соус 30мл, паста том-ям 3-4 ст.л., кокосовое молоко 500мл,рис 200г,заправка для суши " +
            "1-2 ст.л.,черри 250г",

    "Подготовьте морепродукты. Разморозьте любым удобным способом. Я для экономии времени просто заливаю " +
            "прохладной водой, но если есть время, можно выбрать более деликатную разморозку при комнатной температуре. " +
            "Креветки очистите от шелухи. Желательно брать свежемороженные, сырые креветки. " +
            "Не забудьте удалить кишку — сделайте разрез вдоль очищенной креветки сверху и ополосните от непотребства. " +
            "Мидии вычистите и вымойте. В мидиях могут быть остатки тины и песка, которые точно не нужны в конечном блюде. " +
            "Можно брать мидии в ракушках для красивой подачи, но я предпочитаю оставлять в тарелке только то, что можно съесть.",

    "Подготовьте бульон. Роль бульона — наполнить конечный суп умами, " +
            "сделать более насыщенным и глубоким. Можно выбрать разную основу, все равно будет вкусно." +
            "Если у вас неочищенные креветки, можно сварить бульон из их панцирей и голов, также можно взять/сварить" +
            " куриный или рыбный бульон. Тут же можно добавить специи: галангал (можно заменить на имбирь, но все же они отличаются по вкусу) " +
            "нарежьте слайсами. Лимонник очистите от верхнего слоя и разрежьте вдоль, оставив верхушку целой, чтобы она скрепляла волокна. " +
            "Лимонник жёсткий и его не прожевать, а так будет проще вынуть в конце. Листья лайма разомните пальцами. p.s. " +
            "Если нет желания/возможности, можно взять готовый бульон, но тогда лучше купите жидкий концентрат, а не кубики.",

    "Пока варится бульон, промойте и нарежьте овощи: черри пополам, грибы на крупные части (если у вас шампиньоны, можно порезать на 4 части). " +
            "Беби кукурузу на 2-3 части в зависимости от размера. Морковь толстой соломкой, либо можно взять беби морковь и оставить целой. " +
            "Лук порей порежьте кольцами.",

    "Процедите бульон через сито, если необходимо, добавьте том ям пасту, сок половины лайма и рыбный соус. " +
            "Добавьте грибы и оставьте на слабом огне под крышкой на 10 минут. Может показаться, что грибов очень много, " +
            "но они отдадут воду и уменьшатся в объеме через несколько минут. p.s. На этом этапе можно добавить чили перец, если хотите поострее. " +
            "Вместо соли можно использовать соевый соус.",

    "Пока грибы варятся, на сильном огне обжарьте кукурузу и беби-морковь на сливочном масле до золотистой корочки и добавьте в суп. " +
            "Добавьте морепродукты, лук-порей и черри. Влейте кокосовое молоко. Отключите огонь и накройте крышкой. Креветки сварятся от остаточного тепла.",

    "Сварите рис по инструкции и добавьте заправку для суши. Можно купить готовую или сделать самостоятельно, смешав рисовый уксус, сахар и соль."
)

